{
    "title": "Frontend Developer",
    "aboutme-link": "About me",
    "skills-link": "My skills",
    "contact-cta": "Say Hi!",
    "ABOUT_ME": "I am a Frontend Developer from Berlin-Treptow and have worked on projects ranging from landing pages to complex business applications. I developed these projects during my training at the Developer Academy, benefiting greatly from collaboration with other developers and valuable feedback from experienced mentors. For me, the combination of self-directed learning and high-quality feedback is the most effective way to grow, which is why I chose this path over a traditional degree.",
    "CONTACT_ME": "If you think I’d be a good match for your projects, contact me!",
    "LETS_TALK": "Let's talk",
    "skills-title": "My skills",
    "description": "Feel free to try out my latest development projects and look into their code.",
    "join_explanation": "The Join project is a task manager inspired by the Kanban system that allows users to efficiently manage and organize tasks. It includes features such as user registration, individual task management, contact management, and a responsive design for various devices, all implemented with vanilla JavaScript.",
    "pollo_loco_explanation": "El Pollo Loco demonstrates a simple jump 'n' run game that is playable on both desktop and mobile devices. During development, the principles of object-oriented programming were employed to create structured and extensible code.",
    "dabubble_explanation": "DaBubble is a self-developed Slack clone that demonstrates the use of current web technologies in team collaboration. The project offers everything you'd expect from a modern chat tool: user registration, profile management, real-time chats with emojis and file transfer, channel management, and threads.",
    "SAY_HI": "Say Hi!",
    "DISCUSS_PROJECT": "Want to discuss a project?",
    "SAY_HELLO": "Say hello! let's discuss your ideas and make it happen",
    "YOUR_NAME": "Your name",
    "PLEASE_ENTER_NAME": "Please enter a name!",
    "YOUR_EMAIL": "Your email",
    "PLEASE_ENTER_EMAIL": "Please enter an email!",
    "YOUR_MESSAGE": "Your message",
    "PLEASE_ENTER_MESSAGE": "Please enter a message!",
    "PRIVACY_POLICY": "I've read the <a href='legalnotice'>privacy policy</a> and agree to the processing of my data as outlined.",
    "SEND_MESSAGE": "Send message",
    "LEGAL_NOTICE": "Legal notice",
    "LEGAL_NOTICE.TITLE": "Legal Notice",
    "LEGAL_NOTICE.GENERAL_INFORMATION": "General Information",
    "LEGAL_NOTICE.INTERNET": "Internet",
    "LEGAL_NOTICE.SERVICE_PROVIDER": "Name of the Service Provider",
    "LEGAL_NOTICE.ADDRESS_CONTACT": "Address and Contact",
    "LEGAL_NOTICE.PHONE": "Phone",
    "LEGAL_NOTICE.EMAIL": "Email",
    "LEGAL_NOTICE.CREATED_BY": "Created by",
    "PRIVACY_POLICY.TITLE": "Privacy Policy",
    "PRIVACY_POLICY.OVERVIEW_TITLE": "1. Data Protection Overview",
    "PRIVACY_POLICY.GENERAL_INFORMATION": "General Information",
    "PRIVACY_POLICY.GENERAL_DESCRIPTION": "The following notes provide a simple overview of what happens to your personal data when you visit our website. Personal data is any data by which you can be personally identified. Detailed information on data protection can be found in our privacy policy listed below this text.",
    "PRIVACY_POLICY.DATA_COLLECTION_TITLE": "Data Collection on Our Website",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_TITLE": "Who is responsible for data collection on this website?",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_DESCRIPTION": "Data processing on this website is carried out by the website operator. Their contact details can be found in the section \"Notice on the Responsible Body\" in this privacy policy.",
    "PRIVACY_POLICY.HOW_WE_COLLECT_DATA_TITLE": "How do we collect your data?",
    "PRIVACY_POLICY.HOW_WE_COLLECT_DATA_DESCRIPTION": "Your data is collected firstly by you communicating it to us. This can be data that you enter in a contact form, for example.",
    "PRIVACY_POLICY.OTHER_DATA_DESCRIPTION": "Other data is collected automatically or with your consent when you visit the website by our IT systems. This data includes mainly technical information (e.g., web browser, operating system, or the time of the page access). This data is collected automatically as soon as you enter this website.",
    "PRIVACY_POLICY.HOW_WE_USE_DATA_TITLE": "How do we use your data?",
    "PRIVACY_POLICY.HOW_WE_USE_DATA_DESCRIPTION": "Part of the data is collected to ensure the proper functioning of the website. Other data may be used to analyze your user behavior.",
    "PRIVACY_POLICY.YOUR_RIGHTS_TITLE": "What rights do you have regarding your data?",
    "PRIVACY_POLICY.YOUR_RIGHTS_DESCRIPTION": "You have the right to receive information about the origin, recipient, and purpose of your stored personal data at any time for free. You also have the right to request the correction or deletion of this data. If you have given consent to data processing, you can revoke this consent at any time for the future. You also have the right, under certain circumstances, to request the restriction of the processing of your personal data. Furthermore, you have the right to lodge a complaint with the competent supervisory authority.",
    "PRIVACY_POLICY.FURTHER_QUESTIONS_DESCRIPTION": "For this, as well as for further questions on the subject of data protection, you can contact us at any time.",
    "PRIVACY_POLICY.HOSTING_TITLE": "2. Hosting",
    "PRIVACY_POLICY.HOSTING_DESCRIPTION": "We host the content of our website with the following provider:",
    "PRIVACY_POLICY.EXTERNAL_HOSTING_TITLE": "External Hosting",
    "PRIVACY_POLICY.EXTERNAL_HOSTING_DESCRIPTION": "This website is hosted externally. The personal data collected on this website is stored on the servers of the host(s). This data may include IP addresses, contact requests, meta and communication data, contract data, contact details, names, website accesses, and other data generated through a website.",
    "PRIVACY_POLICY.EXTERNAL_HOSTING_REASON": "External hosting is carried out for the purpose of fulfilling contracts with our potential and existing customers (Art. 6(1)(b) GDPR) and in the interest of secure, fast, and efficient provision of our online services by a professional provider (Art. 6(1)(f) GDPR). If a corresponding consent has been requested, the processing is carried out exclusively on the basis of Art. 6(1)(a) GDPR and § 25(1) TDDG, insofar as the consent includes the storage of cookies or access to information in the user's terminal device (e.g., device fingerprinting) within the meaning of the TDDG. The consent can be revoked at any time.",
    "PRIVACY_POLICY.HOSTER_COMPLIANCE": "Our host(s) will process your data only to the extent necessary to fulfill their performance obligations and follow our instructions regarding this data.",
    "PRIVACY_POLICY.HOSTER": "We use the following host(s):",
    "PRIVACY_POLICY.GENERAL_INFO_TITLE": "3. General Information and Mandatory Information",
    "PRIVACY_POLICY.DATA_PROTECTION_TITLE": "Data Protection",
    "PRIVACY_POLICY.DATA_PROTECTION_DESCRIPTION": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy.",
    "PRIVACY_POLICY.PERSONAL_DATA_DESCRIPTION": "When you use this website, various personal data is collected. Personal data is data by which you can be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens.",
    "PRIVACY_POLICY.DATA_SECURITY_DESCRIPTION": "We would like to point out that data transmission over the Internet (e.g., communication by e-mail) can have security gaps. A complete protection of data against access by third parties is not possible.",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_NOTICE_TITLE": "Notice concerning the responsible party",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY": "The responsible party for data processing on this website is:",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_PHONE": "Phone",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_EMAIL": "Email",
    "PRIVACY_POLICY.RESPONSIBLE_PARTY_DESCRIPTION_DETAIL": "The responsible party is the natural or legal person who, alone or jointly with others, decides on the purposes and means of processing personal data (e.g., names, e-mail addresses, etc.).",
    "PRIVACY_POLICY.DATA_RETENTION_TITLE": "Retention Period",
    "PRIVACY_POLICY.DATA_RETENTION_DESCRIPTION": "Unless a more specific retention period has been mentioned within this privacy policy, your personal data will remain with us until the purpose for the data processing no longer applies. If you assert a legitimate request for deletion or revoke your consent to data processing, your data will be deleted, unless we have other legally permissible reasons for storing your personal data (e.g., retention periods under tax or commercial law); in the latter case, the deletion will take place after these reasons cease to apply.",
    "PRIVACY_POLICY.LEGAL_BASE_TITLE": "General information on the legal basis of data processing on this website",
    "PRIVACY_POLICY.LEGAL_BASE_DESCRIPTION": "If you have consented to data processing, we process your personal data on the basis of Art. 6(1)(a) GDPR or Art. 9(2)(a) GDPR if special categories of data are processed according to Art. 9(1) GDPR. In the case of explicit consent to the transfer of personal data to third countries, data processing is also carried out on the basis of Art. 49(1)(a) GDPR. If you have consented to the storage of cookies or access to information in your terminal device (e.g., via device fingerprinting), data processing is additionally carried out on the basis of § 25(1) TDDG. The consent can be revoked at any time. If your data is required for the performance of a contract or for the implementation of pre-contractual measures, we process your data on the basis of Art. 6(1)(b) GDPR. Furthermore, if your data is required for the fulfillment of a legal obligation, we process it on the basis of Art. 6(1)(c) GDPR. Data processing can also be based on our legitimate interest according to Art. 6(1)(f) GDPR. Information on the relevant legal basis in each individual case is provided in the following paragraphs of this privacy policy.",
    "PRIVACY_POLICY.DATA_RECIPIENTS_TITLE": "Recipients of personal data",
    "PRIVACY_POLICY.DATA_RECIPIENTS_DESCRIPTION": "In the context of our business activities, we work with various external parties. In some cases, it is also necessary to transfer personal data to these external parties. We only disclose personal data to external parties if this is necessary within the framework of contract performance, if we are legally obliged to do so (e.g., disclosure of data to tax authorities), if we have a legitimate interest in the disclosure (Art. 6(1)(f) GDPR), or if another legal basis permits the data disclosure. When using processors, we only disclose personal data of our customers on the basis of a valid data processing agreement. In the case of joint processing, a joint processing agreement is concluded.",
    "PRIVACY_POLICY.REVOCATION_TITLE": "Revocation of your consent to data processing",
    "PRIVACY_POLICY.REVOCATION_DESCRIPTION": "Many data processing operations are only possible with your express consent. You can revoke an already given consent at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "PRIVACY_POLICY.OBJECTION_TITLE": "Right to object to data collection in special cases and to direct advertising (Art. 21 GDPR)",
    "PRIVACY_POLICY.OBJECTION_DESCRIPTION": "IF DATA PROCESSING IS BASED ON ART. 6(1)(E) OR (F) GDPR, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA AT ANY TIME FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH A PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR AFFECTED PERSONAL DATA UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR THE PROCESSING WHICH OVERRIDE YOUR INTERESTS, RIGHTS, AND FREEDOMS, OR THE PROCESSING SERVES THE ASSERTION, EXERCISE, OR DEFENSE OF LEGAL CLAIMS (OBJECTION PURSUANT TO ART. 21(1) GDPR).",
    "PRIVACY_POLICY.COMPLAINT_RIGHT_TITLE": "Right to lodge a complaint with the competent supervisory authority",
    "PRIVACY_POLICY.COMPLAINT_RIGHT_DESCRIPTION": "In the event of violations of the GDPR, data subjects have the right to lodge a complaint with a supervisory authority, particularly in the member state of their habitual residence, their place of work, or the place of the alleged violation. The right to lodge a complaint is without prejudice to any other administrative or judicial remedy.",
    "PRIVACY_POLICY.DATA_PORTABILITY_TITLE": "Right to data portability",
    "PRIVACY_POLICY.DATA_PORTABILITY_DESCRIPTION": "You have the right to have data which we process on the basis of your consent or in performance of a contract automatically delivered to you or to a third party in a common, machine-readable format. If you request the direct transfer of the data to another responsible party, this will only be done to the extent technically feasible.",
    "PRIVACY_POLICY.ACCESS_CORRECTION_DELETION_TITLE": "Access, correction, and deletion",
    "PRIVACY_POLICY.ACCESS_CORRECTION_DELETION_DESCRIPTION": "Within the scope of the applicable legal provisions, you have the right at any time to obtain information free of charge about your stored personal data, its origin, and recipient and the purpose of the data processing and, if applicable, a right to correction or deletion of this data. For this purpose, as well as for further questions on the subject of personal data, you can contact us at any time.",
    "PRIVACY_POLICY.RESTRICTION_TITLE": "Right to restriction of processing",
    "PRIVACY_POLICY.RESTRICTION_DESCRIPTION": "You have the right to request the restriction of the processing of your personal data. For this purpose, you can contact us at any time. The right to restriction of processing exists in the following cases:",
    "PRIVACY_POLICY.RESTRICTION_CASE_1": "If you dispute the accuracy of your personal data stored by us, we usually need time to verify this. For the duration of the verification, you have the right to request the restriction of the processing of your personal data.",
    "PRIVACY_POLICY.RESTRICTION_CASE_2": "If the processing of your personal data was/is unlawful, you can request the restriction of data processing instead of deletion.",
    "PRIVACY_POLICY.RESTRICTION_CASE_3": "If we no longer need your personal data, but you need it to exercise, defend, or assert legal claims, you have the right to request the restriction of the processing of your personal data instead of deletion.",
    "PRIVACY_POLICY.RESTRICTION_CASE_4": "If you have lodged an objection pursuant to Art. 21(1) GDPR, a balance must be struck between your and our interests. As long as it is not yet clear whose interests prevail, you have the right to request the restriction of the processing of your personal data.",
    "PRIVACY_POLICY.RESTRICTION_CONSEQUENCE": "If you have restricted the processing of your personal data, this data – apart from being stored – may only be processed with your consent or for the assertion, exercise, or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or a member state."
  }
  
  